<?php
	echo "1-е задание<br>";
	$x = 0;
	while($x<100){
	$x++;
	if($x%3==0){
	echo "$x, ";
	} 
	} 


	echo "<hr>2-е задание<br>";
	
	$i = 0;
	do{
		if($i==0){
		$q = "-это ноль";
			}
		elseif($i%2==0){
			$q = "-это четное число";
			}
		else{
			$q = "-это нечетное число";
		}
		echo "$i $q<br>";
		$i++;
	} while($i<=10);
		
	echo "<hr>3-е задание<br>";
	
	$regs = ["Самарская область" => ["Самара","Чааевск","Тольятти","Кинель"],
			"Московская область" => ["Москва","Зеленоград","Клин"],
			"Ленинградская область" => ["Всеволжск","Павловск","Кронштадт"]					 
		    ];
		  foreach ($regs as $reg => $r){
			echo "$reg: <br>" .implode(', ', $r)."<br>";
		  }
		/* че то я походу не так делаю с создание вложенного массива. Вроде в
			теории все понятно, а практически реализовать не получается.*/
			/* Все разобрался, проблема с синтаксисом, то кавычки не закрыл, то точку забыл*/
	echo "<hr> задание 4<br>";	

	function liter($lit){
	$liter = ['a'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ё'=>'yo','ж'=>'zh','з'=>'z','и'=>'i','й'=>'j','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'kh','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'shch','ъ'=>'-','ы'=>'y','ь'=>'-','э'=>'e','ю'=>'yu','я'=>'ya'];
		return strtr($lit, $liter);
	}
	echo liter("замена букв");


	echo "<hr> задание 5<br>";	

	function rep($spase, $under, $rep){
		return str_replace($spase, $under, $rep);
	}
		echo rep(" ", "_", "З а м е н а  п р о б е л о в  на нижнее подчеркивание");

	echo "<hr> задание 7<br>";
	
	for ($i=0; $i <=9 ; $i++) print_r($i);


	echo "<hr> задание 8<br>";	

	foreach ($regs as $reg => $r){
		foreach ($r as $key => $value) {
			if (mb_substr($value, 0, 1)=="К") {
				echo "$value,";
			}
			
		}
	}

	echo "<hr> задание 9<br>";	

	function url($url){
		return liter(rep(" ", "_", $url));
	}
	echo url("замена символов в урл");
?>	